export const TermServiceText = () => {
  return (
    <div className="flex flex-col w-full flex-wrap">
      <h2>제1장</h2>
      <h3>[총칙]</h3>
      <p className="pt-2">
        제1조(목적){" "}
        <p>
          본 약관은 제이앤코어(이하 "당사")가 운영하는 홈페이지에서 제공하는
          온라인 서비스의 이용과 관련한 제반 사항을 명확히 규정함으로써
          이용자(아래에서 정의함)의 권리, 의무, 책임 사항 및 서비스 이용절차
          등에 관한 사항을 정함에 목적이 있습니다.
        </p>
      </p>
      <p>
        ※「PC통신, 무선 등을 이용하는 전자상거래에 대해서도 그 성질에 반하지
        않는 한 본 약관을 준용합니다」
      </p>
      <p className="pt-2">
        제2조(용어의 정의)
        <p>
          {" "}
          본 약관에서 사용하는 주요 용어의 정의는 다음과 같습니다.
          <p>
            1. "회원 서비스"란 당사가 회원에게 제공하는 서비스 프로그램을
            말합니다.
          </p>
          <p>
            2. "회원"이란 제6조의 절차에 따라 회원가입 절차를 완료한 자를
            의미합니다.
          </p>
          <p>
            3. "서비스"란 다양한 정보의 제공 및 상품(재화와 용역 포함)의 판매
            또는 상품과 관련한 다양한 판촉행위 및, 기타 부가 서비스를 말하며,
            당사가 운영하는 홈페이지에서 제공하는 온라인 서비스 및 오프라인 매장
            서비스를 포함합니다.
          </p>
          <p>
            4. "사이트"란 당사가 운영하는 홈페이지로서 "서비스"를 이용자에게
            제공하기 위하여 컴퓨터 등 정보통신설비를 이용하여 설정한 가상의
            영업장을 말하며, 아울러 이를 운영하는 사업자의 의미로도 사용합니다.
          </p>
          <p>5. "이용자"란 "사이트"에 접속한 "회원"과 "비회원"을 말합니다.</p>
          <p>
            6. "포인트"란 회원이 당사에서 판매되는 상품이나 "서비스"를
            구매하거나, "서비스" 참여 활동 시 또는 당사 및 제휴사에서 제공하는
            이벤트, 추가 적립 포인트 등 마케팅 활동 등과 관련하여 획득한 아래의
            포인트를 말합니다.
            <p>
              ① "구매 적립 포인트"란 회원이 제품 구입시 약정된 적립률에 따라
              적립된 포인트를 말합니다.
            </p>
            <p>
              ② "부가포인트"란 자기적립가용포인트 사용 시 부가가치세만큼 가용
              포인트로 전환되는 포인트를 말합니다.
            </p>
            <p>
              ③ "이벤트 포인트"란 당사가 이벤트 진행 시 제공하는 포인트를
              말합니다.
            </p>
            <p>
              ④ "발생 포인트"란 구매적립포인트를 적립하거나 또는 이벤트 포인트를
              제공받아 당사로부터 가용 포인트로 전환되는 것으로 인정받는
              포인트입니다.
            </p>
            <p>
              ⑤ "누적 포인트"란 회원이 적법하게 부여받은 포인트 중 이미 사용한
              포인트를 제외한 나머지 포인트의 합계를 말합니다.
            </p>
            <p>
              ⑥ "가용 포인트"란 누적 포인트에서 소멸된 포인트 또는 환수된
              포인트를 제외한 현재 현금 대체 결제로 사용 가능한 포인트를
              말합니다.
            </p>
          </p>
        </p>
      </p>
      <p className="mt-2">
        제3조 (약관의 게시와 개정) <br />
        1. 본 약관의 내용과 상호 및 대표자 성명, 영업소 소재지 주소(소비자의
        불만을 처리할 수 있는 곳의 주소 포함), 전화번호, 모사전송번호,
        전자우편주소, 사업자등록번호, 통신판매업신고번호, 개인정보관리책임자
        등을 이용자가 쉽게 알 수 있도록 "사이트"의 초기 "서비스"화면(전면)에
        게시합니다. 다만, 약관의 내용은 이용자가 연결화면을 통하여 볼 수 있도록
        할 수 있습니다. <br />
        2. 전자상거래 등에서의 소비자보호에 관한 법률, 약관의 규제에 관한 법률,
        전자문서 및 전자거래 기본법, 전자서명법, 정보통신망 이용촉진 및 정보보호
        등에 관한 법률, 방문판매 등에 관한 법률, 소비자기본법 등 관련 법률을
        위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.
        <br /> 3. 본 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여
        현행약관과 함께 "사이트"의 초기화면에 그 적용일자 7일 이전부터 적용일자
        전일까지 공지합니다. 다만, 이용자에게 불리하게 약관내용을 변경하는
        경우에는 최소한 30일 이상의 사전 유예기간을 두고 공지합니다. 이 경우
        "사이트"는 개정 전 내용과 개정 후 내용을 명확하게 비교하여 이용자가 알기
        쉽도록 표시합니다. <br />
        4. 개정약관은 그 적용일자 이후에 체결되는 계약에만 적용되고 그 이전에
        이미 체결된 계약에 대해서는 개정 전의 약관조항이 그대로 적용됩니다. 다만
        이미 "영업점" 또는 "사이트"에서 계약을 체결한 회원이 개정약관 조항의
        적용을 받기를 원하는 뜻을 제3항에 의한 개정약관의 공지기간 내에
        "사이트"에 게시함으로써 "사이트"의 동의를 받은 경우에는 개정약관 조항이
        적용됩니다. <br />
        5. 개정된 약관은 원칙적으로 적용일자부터 유효하며, 본 약관의 개정과
        관련하여 이의가 있는 회원은 회원탈퇴를 할 수 있습니다. <br />
        6. 개정된 약관의 적용일자까지 탈퇴하지 않거나 별도로 당사에 이의를
        제기하지 않는 경우 변경된 약관에 동의한 것으로 간주합니다.
        <br /> 7. 본 약관에서 정하지 아니한 사항과 본 약관의 해석에 관하여는
        전자상거래 등에서의 소비자보호에 관한 법률, 약관의 규제 등에 관한 법률,
        공정거래위원회가 정하는 전자상거래 등에서의 소비자보호 지침 및 관계법령
        또는 상관례에 따릅니다.
      </p>
      <p className="mt-2"></p>
    </div>
  );
};
